magnus_effect/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    domain_boundary
    {
        type            freestream;
        freestreamValue uniform (10 0 0);
    }
    cylinder
    {
        type            rotatingWallVelocity;
        origin          ( 0 0 0 );
        axis            ( 0 0 1 );
        omega           -200;
    }
}


// ************************************************************************* //
