magnus_effect/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

applicationClass	pimpleFoam;
startFrom        	latestTime;
endTime			1;
stopAt 			endTime;
deltaT			1;
writeControl    	adjustableRunTime;
writeInterval		0.01;
cycleWrite      	0;
writeFormat     	ascii;
writePrecision		6;
writeCompression 	uncompressed;
timeFormat      	general;
timePrecision   	6;
runTimeModifiable	yes;
adjustTimeStep		yes;
maxCo			2;
maxDeltaT		1;

// ************************************************************************* //
